# FamilyThermalProperties Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
FamilyThermalProperties Methods
FamilyThermalProperties Class See Also
---
The FamilyThermalProperties type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose |
| Equals | Determines whether the specified Object is equal to the current Object. (Inherited from Object.) |
| Find | Finds the thermal properties by the 'id' property of a constructionType node in Constructions.xml. |
| GetHashCode | Serves as a hash function for a particular type.  (Inherited from Object.) |
| GetType | Gets the Type of the current instance. (Inherited from Object.) |
| IsValid | Confirms that the thermal properties are correctly set for assignment to a FamilySymbol. |
| ToString | Returns a string that represents the current object. (Inherited from Object.) |

# See Also
FamilyThermalProperties Class
Autodesk.Revit.DB Namespace